---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.ComputeAreaOfCurveLoops(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
source: html/57f85e13-8ea8-01af-2660-94f1ff5cf7ea.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.ComputeAreaOfCurveLoops Method

## Syntax (C#)
```csharp
public static double ComputeAreaOfCurveLoops(
	IList<CurveLoop> curveLoops
)
```

## Parameters
- **curveLoops** (`System.Collections.Generic.IList < CurveLoop >`)